#include <stdio.h>

int main() {
    int a;
    int* p = &a;

    scanf_s("%d", &a); // Въвеждане на стойност на a

    printf("Стойност на a: %d\n", a);       // 10
    printf("Адрес на a: %p\n", &a);        // напр. 0x7ffc1234
    printf("Стойност на p (адрес): %p\n", p);   // същият адрес
    printf("Стойност чрез *p: %d\n", *p);  // 10 (достъп до стойността на a чрез p)

    // Промяна на стойността чрез указателя:
    *p = 20;
    printf("Нова стойност на a: %d\n", a); // 20

    return 0;
}
